---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionPipestandardWalldesignthickness
source: html/cd6d6f9c-3675-0aa5-a1da-948c3c15866c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionPipestandardWalldesignthickness Property

"Wall Design Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionPipestandardWalldesignthickness { get; }
```